# IsProfileFlipped Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..IsProfileFlipped Property
WallSweepInfo Class See Also
---
Indicates if the profile is applied upside-down.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsProfileFlipped { get; set; }
```

Visual Basic
---
```text
Public Property IsProfileFlipped As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsProfileFlipped {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if the profile is applied upside-down, false otherwise.
# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace